Autodesk.Revit.DB.Structure.AnalyticalCurveSelector
Specifies which portion of an Analytical Curve is of interest.

Autodesk.Revit.DB.Structure.AnalyticalCurveSelector.WholeCurve
Entire curve.

Autodesk.Revit.DB.Structure.AnalyticalCurveSelector.EndPoint
End of curve (corresponds to end = 1).

Autodesk.Revit.DB.Structure.AnalyticalCurveSelector.StartPoint
Start of curve (corresponds to end = 0).